<html data-ember-extensions="1">
<script type="text/javascript">window.NREUM||(NREUM={});NREUM.info={"beacon":"bam.nr-data.net","errorBeacon":"bam.nr-data.net","licenseKey":"3d26605ce4","applicationID":"12678344","transactionName":"e1tdF0JdWwoDRUwMD15bHARCU0cOOVAWDAVd","queueTime":0,"applicationTime":99,"agent":""}</script>
<script type="text/javascript">window.NREUM||(NREUM={}),__nr_require=function(e,t,n){function r(n){if(!t[n]){var o=t[n]={exports:{}};e[n][0].call(o.exports,function(t){var o=e[n][1][t];return r(o||t)},o,o.exports)}return t[n].exports}if("function"==typeof __nr_require)return __nr_require;for(var o=0;o<n.length;o++)r(n[o]);return r}({1:[function(e,t,n){function r(){}function o(e,t,n){return function(){return i(e,[(new Date).getTime()].concat(u(arguments)),t?null:this,n),t?void 0:this}}var i=e("handle"),a=e(2),u=e(3),c=e("ee").get("tracer"),f=NREUM;"undefined"==typeof window.newrelic&&(newrelic=f);var s=["setPageViewName","setCustomAttribute","setErrorHandler","finished","addToTrace","inlineHit","addRelease"],l="api-",p=l+"ixn-";a(s,function(e,t){f[t]=o(l+t,!0,"api")}),f.addPageAction=o(l+"addPageAction",!0),f.setCurrentRouteName=o(l+"routeName",!0),t.exports=newrelic,f.interaction=function(){return(new r).get()};var d=r.prototype={createTracer:function(e,t){var n={},r=this,o="function"==typeof t;return i(p+"tracer",[Date.now(),e,n],r),function(){if(c.emit((o?"":"no-")+"fn-start",[Date.now(),r,o],n),o)try{return t.apply(this,arguments)}finally{c.emit("fn-end",[Date.now()],n)}}}};a("setName,setAttribute,save,ignore,onEnd,getContext,end,get".split(","),function(e,t){d[t]=o(p+t)}),newrelic.noticeError=function(e){"string"==typeof e&&(e=new Error(e)),i("err",[e,(new Date).getTime()])}},{}],2:[function(e,t,n){function r(e,t){var n=[],r="",i=0;for(r in e)o.call(e,r)&&(n[i]=t(r,e[r]),i+=1);return n}var o=Object.prototype.hasOwnProperty;t.exports=r},{}],3:[function(e,t,n){function r(e,t,n){t||(t=0),"undefined"==typeof n&&(n=e?e.length:0);for(var r=-1,o=n-t||0,i=Array(o<0?0:o);++r<o;)i[r]=e[t+r];return i}t.exports=r},{}],ee:[function(e,t,n){function r(){}function o(e){function t(e){return e&&e instanceof r?e:e?c(e,u,i):i()}function n(n,r,o){if(!p.aborted){e&&e(n,r,o);for(var i=t(o),a=v(n),u=a.length,c=0;c<u;c++)a[c].apply(i,r);var f=s[w[n]];return f&&f.push([y,n,r,i]),i}}function d(e,t){b[e]=v(e).concat(t)}function v(e){return b[e]||[]}function g(e){return l[e]=l[e]||o(n)}function m(e,t){f(e,function(e,n){t=t||"feature",w[n]=t,t in s||(s[t]=[])})}var b={},w={},y={on:d,emit:n,get:g,listeners:v,context:t,buffer:m,abort:a,aborted:!1};return y}function i(){return new r}function a(){(s.api||s.feature)&&(p.aborted=!0,s=p.backlog={})}var u="nr@context",c=e("gos"),f=e(2),s={},l={},p=t.exports=o();p.backlog=s},{}],gos:[function(e,t,n){function r(e,t,n){if(o.call(e,t))return e[t];var r=n();if(Object.defineProperty&&Object.keys)try{return Object.defineProperty(e,t,{value:r,writable:!0,enumerable:!1}),r}catch(i){}return e[t]=r,r}var o=Object.prototype.hasOwnProperty;t.exports=r},{}],handle:[function(e,t,n){function r(e,t,n,r){o.buffer([e],r),o.emit(e,t,n)}var o=e("ee").get("handle");t.exports=r,r.ee=o},{}],id:[function(e,t,n){function r(e){var t=typeof e;return!e||"object"!==t&&"function"!==t?-1:e===window?0:a(e,i,function(){return o++})}var o=1,i="nr@id",a=e("gos");t.exports=r},{}],loader:[function(e,t,n){function r(){if(!h++){var e=y.info=NREUM.info,t=l.getElementsByTagName("script")[0];if(setTimeout(f.abort,3e4),!(e&&e.licenseKey&&e.applicationID&&t))return f.abort();c(b,function(t,n){e[t]||(e[t]=n)}),u("mark",["onload",a()],null,"api");var n=l.createElement("script");n.src="https://"+e.agent,t.parentNode.insertBefore(n,t)}}function o(){"complete"===l.readyState&&i()}function i(){u("mark",["domContent",a()],null,"api")}function a(){return(new Date).getTime()}var u=e("handle"),c=e(2),f=e("ee"),s=window,l=s.document,p="addEventListener",d="attachEvent",v=s.XMLHttpRequest,g=v&&v.prototype;NREUM.o={ST:setTimeout,CT:clearTimeout,XHR:v,REQ:s.Request,EV:s.Event,PR:s.Promise,MO:s.MutationObserver},e(1);var m=""+location,b={beacon:"bam.nr-data.net",errorBeacon:"bam.nr-data.net",agent:"js-agent.newrelic.com/nr-1016.min.js"},w=v&&g&&g[p]&&!/CriOS/.test(navigator.userAgent),y=t.exports={offset:a(),origin:m,features:{},xhrWrappable:w};l[p]?(l[p]("DOMContentLoaded",i,!1),s[p]("load",r,!1)):(l[d]("onreadystatechange",o),s[d]("onload",r)),u("mark",["firstbyte",a()],null,"api");var h=0},{}]},{},["loader"]);</script><body><style type="text/css" media="screen">
  /*
  .nodes-image {
    margin:-100;
  }
  */	
  @import url("//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css");

  .imageblock .content img {max-width: 900px;max-height: 300px;}
  .deck h3, .deck h4 {display: block !important;margin-bottom:8px;margin-top:5px;}
  .listingblock {margin:8px;}
  .pull-bottom {position:relative;bottom:1em;}
  .admonitionblock td.icon [class^="fa icon-"]{font-size:2.5em;text-shadow:1px 1px 2px rgba(0,0,0,.5);cursor:default}
  .admonitionblock td.icon .icon-note:before{content:"\f05a";color:#19407c}
  .admonitionblock td.icon .icon-tip:before{content:"\f0eb";text-shadow:1px 1px 2px rgba(155,155,0,.8);color:#111}
  .admonitionblock td.icon .icon-warning:before{content:"\f071";color:#bf6900}
  .admonitionblock td.icon .icon-caution:before{content:"\f06d";color:#bf3400}
  .admonitionblock td.icon .icon-important:before{content:"\f06a";color:#bf0000}
</style>
<style type="text/css" media="screen">
  #editor.maximize-editor .CodeMirror-code { font-size:40px; line-height:45px; }
</style>
<article class="guide" ng-controller="AdLibDataController">
  <carousel class="deck container-fluid">
    <!--slide class="row-fluid">
      <div class="col-sm-3">
        <h3>The TrumpWorld Graph</h3>
        <p class="lead">Information</p>
        <!dl>
          
        </dl>
      </div>
      <div class="col-sm-9">
        <figure>
          <img style="width:300px" src=""/>
        </figure>
      </div>
    </slide-->

    


  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>The TrumpWorld Graph</h3>
      <br/>
      <div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Importing the Buzzfeed TrumpWorld Dataset into Neo4j</h3>
      <br/>
      <div><div class="paragraph">
<p>I came across this tweet by Sanchez Castro (@SCHZCAS) which I&#8217;m more than happy to support.</p>
</div>
<blockquote class="twitter-tweet" data-lang="en"><p lang="en" dir="ltr">Hey <a href="https://twitter.com/neo4j">@neo4j</a> please do this once again!!! <a href="https://twitter.com/hashtag/panamapapers?src=hash">#panamapapers</a> <a href="https://twitter.com/hashtag/neo4j?src=hash">#neo4j</a><br> <a href="https://t.co/B8pjxNKCyA">https://t.co/B8pjxNKCyA</a></p>&mdash; sanchezcastro (@SCHZCAS) <a href="https://twitter.com/SCHZCAS/status/820679713064714241">January 15, 2017</a></blockquote>
<script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script>
<div class="paragraph">
<p>As part of the Buzzfeed article <a href="https://www.buzzfeed.com/johntemplon/help-us-map-trumpworld?utm_term=.kd5QM0z1q#.ekLzoZ316">Help Us Map TrumpWorld</a>, the four investigative journalists, John Templon, Alex Campbell, Anthony Cormier, and Jeremy Singer-Vine asked the public to help them map and analyze the data that they investigated, confirmed and published:</p>
</div>
<div class="quoteblock">
<blockquote>
<div class="paragraph">
<p>Now we are asking the public to use our data to find connections we may have missed, and to give us context we don’t currently understand.
We hope you will help us — and the public — learn more about TrumpWorld and how this unprecedented array of businesses might affect public policy.</p>
</div>
</blockquote>
</div>
<div class="imageblock">
<div class="content">
<img src="https://img.buzzfeed.com/buzzfeed-static/static/2017-01/13/13/asset/buzzfeed-prod-fastlane-01/sub-buzz-31493-1484333437-1.jpg?no-auto" alt="sub buzz 31493 1484333437 1">
</div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Setup with Local Database</h3>
      <br/>
      <div><div class="paragraph">
<p>If you want to work with this data locally, please <a href="http://neo4j.com/download"><strong>download and install</strong></a> Neo4j 3.1.</p>
</div>
<div class="paragraph">
<p>When using Neo4j Desktop, you can find configuration and directories on the <code>Options</code> pane which you open with the button of the same name.</p>
</div>
<div class="paragraph">
<p>If you want to <strong>run this guide inside of your Neo4j-Browser</strong>, you can edit the database configuration from the Options pane and add the following setting:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">browser.remote_content_hostname_whitelist=http://portal.graphgist.org</pre>
    
  </div>
</div>
<div class="paragraph">
<p>Then restart the database and you&#8217;re ready to roll, by running this command:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">:play http://portal.graphgist.org/graph_gists/trumpworld-graph/graph_guide</pre>
    
  </div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Looking at the Data</h3>
      <br/>
      <div><div class="paragraph">
<p>The <a href="https://www.buzzfeed.com/johntemplon/help-us-map-trumpworld">Buzzfeed article</a> linked int he tweet points to a Google Spreadsheet with collected and verified/researched data of relationships of Trump organizations to other organizations, in total we have 770 organizations (as of today) with 611 relationships.</p>
</div>
<div class="paragraph">
<p>The data is fortunately available as a public google doc, so we can use our old trick of loading the CSV-Download URL with <code>LOAD CSV</code> into Neo4j.</p>
</div>
<div class="paragraph">
<p>Let&#8217;s have a look at the data first, here as a sample:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">WITH
'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&amp;gid=634968401' AS url
LOAD CSV WITH HEADERS FROM url AS row
RETURN row.`Organization A`,row.`Organization B`,row.Connection, row.`Source(s)`
LIMIT 5</code>
      </pre>
    
  </div>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">╒════════════════════════════════════╤═══════════════════════════════╤════════════════╤══════════════════════════════════════════════════════════════════════════════════════╕
│"row.`Organization A`"              │"row.`Organization B`"         │"row.Connection"│"row.`Source(s)`"                                                                     │
╞════════════════════════════════════╪═══════════════════════════════╪════════════════╪══════════════════════════════════════════════════════════════════════════════════════╡
│"4 SHADOW TREE LANE MEMBER CORP."   │"4 SHADOW TREE LANE LLC"       │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼───────────────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"40 WALL DEVELOPMENT ASSOCIATES LLC"│"40 WALL STREET LLC"           │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼───────────────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"40 WALL STREET LLC"                │"40 WALL STREET COMMERCIAL LLC"│"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼───────────────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"40 WALL STREET MEMBER CORP."       │"40 WALL STREET LLC"           │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼───────────────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"401 MEZZ VENTURE LLC"              │"401 NORTH WABASH VENTURE LLC" │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
└────────────────────────────────────┴───────────────────────────────┴────────────────┴──────────────────────────────────────────────────────────────────────────────────────┘</pre>
    
  </div>
</div>
<div class="paragraph">
<p>The most frequently mentioned organizations found by this query:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">WITH
'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&amp;gid=634968401' AS url
LOAD CSV FROM url AS row
WITH row
UNWIND  row[0..1] AS org
RETURN org, count(*)
ORDER BY count(*) DESC LIMIT 10</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>We see the usual suspect on top.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">╒═══════════════════════════════════════════╤══════════╕
│"org"                                      │"count(*)"│
╞═══════════════════════════════════════════╪══════════╡
│"THRIVE CAPITAL"                           │79        │
├───────────────────────────────────────────┼──────────┤
│"DJT HOLDINGS LLC"                         │32        │
├───────────────────────────────────────────┼──────────┤
│"TRUMP ORGANIZATION LLC"                   │14        │
├───────────────────────────────────────────┼──────────┤
│"KUSHNER COMPANIES"                        │13        │
├───────────────────────────────────────────┼──────────┤
│"TTTT VENTURE LLC"                         │7         │
├───────────────────────────────────────────┼──────────┤
│"MNC GROUP"                                │5         │
├───────────────────────────────────────────┼──────────┤
│"DEUTSCHE BANK"                            │5         │
├───────────────────────────────────────────┼──────────┤
│"GOLDMAN SACHS"                            │4         │
├───────────────────────────────────────────┼──────────┤
│"TRUMP INTERNATIONAL HOTELS MANAGEMENT LLC"│3         │
├───────────────────────────────────────────┼──────────┤
│"THE DONALD J. TRUMP REVOCABLE TRUST"      │3         │
└───────────────────────────────────────────┴──────────┘</pre>
    
  </div>
</div>
<div class="paragraph">
<p>What kind of relationships exist in the data:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">WITH
'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&amp;gid=634968401' AS url
LOAD CSV WITH HEADERS FROM url AS row
RETURN row.Connection AS type, count(*)
ORDER BY count(*) DESC</code>
      </pre>
    
  </div>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">╒════════════════════════════════════════════════════════════════════════════════════════════════════╤══════════╕
│"type"                                                                                              │"count(*)"│
╞════════════════════════════════════════════════════════════════════════════════════════════════════╪══════════╡
│"Ownership"                                                                                         │309       │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"Investor"                                                                                          │90        │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"Owns collateralized debt"                                                                          │54        │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"Subsidiary"                                                                                        │41        │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"NKA/FKA"                                                                                           │28        │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"DBA"                                                                                               │16        │
....
│"Anbang would become one of the equity partners in the [666 Fifth Avenue] redevelopment if an agreem│1         │
│ent is finalized, per New York Times"                                                               │          │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"an investment firm involved in Trump Organization projects abroad, per New York Times"             │1         │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"Kushner-affiliated corporate entity, per New York Magazine"                                        │1         │
│"Lobbied for"                                                                                       │1         │
├────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┤
│"Partners on Trump Hotel Rio de Janeiro"                                                            │1         │
└────────────────────────────────────────────────────────────────────────────────────────────────────┴──────────┘</pre>
    
  </div>
</div>
<div class="paragraph">
<p>While some of them like <code>Ownership</code>, or <code>Investor</code> are straightforward others (<code>Anbang would become one of the equity partners in the [666 Fifth Avenue] redevelopment if an agreement is finalized, per New York Times</code>) are very specific, and probably not a good choice for relationship-type to query on.</p>
</div>
<div class="paragraph">
<p>So we have <strong>two options</strong>, one could be to use a <strong>generic</strong> relationship and put all the <code>Connection</code> information into a property, or <strong>alternatively</strong> we do some cleanup/unification and have a <strong>richer set</strong> of relationships.</p>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Simple, Direct Data Import</h3>
      <br/>
      <div><div class="paragraph">
<p>We look at the simpler variant here, to quickly get results.
THe unification approach is <a href="http://portal.graphgist.org/graph_gists/834c8437-f713-420d-8c0b-979a2d067485">demonstrated here</a>, for those of you that want to have a bit more interesting graph model.</p>
</div>
<div class="paragraph">
<p>After creating the two needed constraints, we can directly import the data with Neo4j&#8217;s <code>LOAD CSV</code> command.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">CREATE CONSTRAINT ON (o:Organization) ASSERT o.name IS UNIQUE;</code>
      </pre>
    
  </div>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">CREATE CONSTRAINT ON (p:Person) ASSERT p.name IS UNIQUE;</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>Connect organizations with other organizations from the 1st tab.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">WITH 'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&amp;gid=634968401' AS url
LOAD CSV WITH HEADERS FROM url AS row
MERGE (o1:Organization {name:row.`Organization A`})
MERGE (o2:Organization {name:row.`Organization B`})
CREATE (o1)-[con:CONNECTED_TO]->(o2)
SET con.connection=row.Connection, con.source=row.`Source(s)`</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>Connect people with organizations from the 2nd tab.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">WITH 'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&amp;gid=1368567920' AS url
LOAD CSV WITH HEADERS FROM url AS row
MERGE (p:Person {name:row.Person})
MERGE (o:Organization {name:row.Organization})
CREATE (p)-[con:INVOLVED_WITH]->(o)
SET con.connection=row.Connection, con.source=row.`Source(s)`</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>Connect people with other people from the 3rd tab.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">WITH 'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&amp;gid=905294723' AS url
LOAD CSV WITH HEADERS FROM url AS row
MERGE (p1:Person {name:row.`Person A`})
MERGE (p2:Person {name:row.`Person B`})
CREATE (p2)-[con:RELATED_TO]->(p1)
SET con.connection=row.Connection, con.source=row.`Source(s)`</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>Now we have all data of the <a href="https://docs.google.com/spreadsheets/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/edit#gid=1368567920">Buzzfeed spreadsheet</a> imported and can start asking some interesting questions.</p>
</div>
<div class="paragraph">
<p>This is what TrumpWorld looks like.</p>
</div>
<div class="imageblock">
<div class="content">
<img src="https://dl.dropboxusercontent.com/u/14493611/trumpworld-simple.jpg" alt="trumpworld simple">
</div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Data Enrichment</h3>
      <br/>
      <div><div class="paragraph">
<p>We can enrich this graph, eg. by labeling organizations:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (o:Organization)
WHERE o.name CONTAINS "BANK" SET o:Bank</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>We find 17 banks (there are certainly more).</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (o:Organization)
WHERE o.name CONTAINS "HOTEL" SET o:Hotel</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>We find 34 hotels (there are certainly more).</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (o:Organization)
WHERE any(term in ["TRUMP","DT","DJT"] WHERE o.name CONTAINS (term + " "))
SET o:Trump</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>We find 405 "Trump" organizations (there are certainly more).</p>
</div>
<div class="paragraph">
<p>There should be more labeling, but we leave that for later.</p>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Banks in the Graph</h3>
      <br/>
      <div><div class="paragraph">
<p>Now we can start running some queries:</p>
</div>
<div class="paragraph">
<p>E.g. what relationships do banks have to which other organizations in our dataset:</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (n:Bank)--(o) RETURN *</code>
      </pre>
    
  </div>
</div>
<div class="paragraph">
<p>Which YIELDs this interesting graph:</p>
</div>
<div class="imageblock">
<div class="content">
<img src="https://dl.dropboxusercontent.com/u/14493611/trumpworld-simple-banks.jpg" alt="trumpworld simple banks">
</div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Connections between Organizations</h3>
      <br/>
      <div><div class="paragraph">
<p>Looking at orgnaizations, <strong>Trump Tower Commercial LLC</strong> and <strong>40 Wall Street LLC</strong> are some of Trump&#8217;s most prized possessions.
Let&#8217;s have a look between and around them.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">MATCH (o1:Organization {name:"TRUMP TOWER COMMERCIAL LLC"})
MATCH (o2:Organization {name:"40 WALL STREET LLC"})
MATCH path = (o1)-[*..3]-(o2)
RETURN path</pre>
    
  </div>
</div>
<div class="imageblock">
<div class="content">
<img src="https://dl.dropboxusercontent.com/u/14493611/trump-organizations.jpg" alt="trump organizations">
</div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Kushner Network</h3>
      <br/>
      <div><div class="paragraph">
<p>We can now look for instance at the 2nd degree network of "Jared Kushner":</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH network = (:Person {name:"JARED KUSHNER"})-[*..2]-()
RETURN network</code>
      </pre>
    
  </div>
</div>
<div class="imageblock">
<div class="content">
<img src="https://dl.dropboxusercontent.com/u/14493611/trumpworld-simple-kushner.jpg" alt="trumpworld simple kushner">
</div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Most Connected People</h3>
      <br/>
      <div>



<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (p:Person)-[r]-()
RETURN p.name, type(r) AS type, count(*) AS degree
ORDER BY degree DESC
LIMIT 10</code>
      </pre>
    
  </div>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">╒══════════════════╤═══════════════╤════════╕
│"p.name"          │"type"         │"degree"│
╞══════════════════╪═══════════════╪════════╡
│"DONALD J. TRUMP" │"INVOLVED_WITH"│550     │
├──────────────────┼───────────────┼────────┤
│"WILBUR ROSS"     │"INVOLVED_WITH"│127     │
├──────────────────┼───────────────┼────────┤
│"DONALD J. TRUMP" │"RELATED_TO"   │54      │
├──────────────────┼───────────────┼────────┤
│"BETSY DEVOS"     │"INVOLVED_WITH"│45      │
├──────────────────┼───────────────┼────────┤
│"ELAINE CHAO"     │"INVOLVED_WITH"│36      │
├──────────────────┼───────────────┼────────┤
│"JOSHUA KUSHNER"  │"INVOLVED_WITH"│23      │
├──────────────────┼───────────────┼────────┤
│"REX TILLERSON"   │"INVOLVED_WITH"│20      │
├──────────────────┼───────────────┼────────┤
│"JARED KUSHNER"   │"INVOLVED_WITH"│19      │
├──────────────────┼───────────────┼────────┤
│"DONALD TRUMP JR."│"INVOLVED_WITH"│15      │
├──────────────────┼───────────────┼────────┤
│"BEN CARSON"      │"INVOLVED_WITH"│14      │
└──────────────────┴───────────────┴────────┘</pre>
    
  </div>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Connection from Putin to Trump</h3>
      <br/>
      <div><div class="paragraph">
<p>As expected via Rex Tillerson, but interestingly the connection between Tillerson and Trump as Nominee for Secretary of State seems to be missing from the data.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (vp:Person {name:"VLADIMIR PUTIN"}),(dt:Person {name:"DONALD J. TRUMP"})
MATCH path = allShortestPaths( (vp)-[*]-(dt) )
RETURN path</code>
      </pre>
    
  </div>
</div>
<div class="imageblock">
<div class="content">
<img src="https://dl.dropboxusercontent.com/u/14493611/trump-putin.jpg" alt="trump putin">
</div>
</div>
<div class="paragraph">
<p>So let&#8217;s check the data.</p>
</div></div>
    </div>
  </slide>




  
  <slide class="row-fluid">
    <div class="col-sm-12">
      <h3>Nominees of Trumps Cabinet</h3>
      <br/>
      <div><div class="paragraph">
<p>And really Tillerson is missing, there are only 19 in the list.</p>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      

      <pre mode="cypher" class="highlight pre-scrollable code runnable standalone-example ng-binding" lang="">
        <code class="cypher language-cypher">MATCH (p:Person)-[con:RELATED_TO]-&gt;()
WHERE con.connection CONTAINS "Nominee"
RETURN p.name, con.connection
ORDER BY p.name ASC</code>
      </pre>
    
  </div>
</div>




<div id="" class="listingblock">
  
  <div class="content">
    
      <pre class="">╒═══════════════════╤══════════════════════════════════════════════════════════════════════════╕
│"p.name"           │"con.connection"                                                          │
╞═══════════════════╪══════════════════════════════════════════════════════════════════════════╡
│"ANDY PUZDER"      │"Nominee for Secretary of Labor"                                          │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"BEN CARSON"       │"Nominee for Secretary of HUD"                                            │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"BETSY DEVOS"      │"Nominee for Secretary of Education"                                      │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"DAN COATS"        │"Nominee for Director of National Intelligence"                           │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"ELAINE CHAO"      │"Nominee for Secretary of Transportation"                                 │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"JAMES MATTIS"     │"Nominee for Secretary of Defense"                                        │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"JEFF SESSIONS"    │"Nominee for Attorney General"                                            │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"JOHN F. KELLY"    │"Nominee for Secretary of Department of Homeland Security"                │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"LINDA MCMAHON"    │"Nominee for Administrator of the Small Business Administration"          │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"MICHAEL POMPEO"   │"Nominee for Director of CIA"                                             │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"MICK MULVANEY"    │"Nominee for Director of Office of Management and Budget"                 │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"NIKKI HALEY"      │"Nominee for Ambassador to the United Nations"                            │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"RICK PERRY"       │"Nominee for Secretary of Energy"                                         │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"ROBERT LIGHTHIZER"│"Nominee for U.S. Trade Representative"                                   │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"RYAN ZINKE"       │"Nominee for Secretary of Interior"                                       │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"SCOTT PRUITT"     │"Nominee for Administrator of the Environmental Protection Administration"│
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"STEVEN MNUCHIN"   │"Nominee for Secretary of Treasury"                                       │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"TOM PRICE"        │"Nominee for Secretary of Health and Human Services"                      │
├───────────────────┼──────────────────────────────────────────────────────────────────────────┤
│"WILBUR ROSS"      │"Nominee for Secretary of Commerce"                                       │
└───────────────────┴──────────────────────────────────────────────────────────────────────────┘</pre>
    
  </div>
</div>
<div class="paragraph">
<p>Our friends from Linkurious used part of my work for a <a href="https://linkurio.us/visualizing-network-donald-trump/">blog post</a> demonstrating how to visualize this data with their tool.</p>
</div></div>
    </div>
  </slide>

  </carousel>
</article></body></html>